; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v2 ?v6)
             (pred_4 ?v3 ?v8)
             (pred_7 ?v2 ?v8)
             (pred_11 ?v5 ?v2 )
	     (pred_9 ?v2)
             (pred_1 ?v1)
             (pred_10 ?v3)
             (pred_12 ?v8)
             (pred_2 ?v2)
             (pred_8 ?v3)
             (pred_6 ?v2)
             (pred_5 ))



(:action op_1
:parameters (?v12 ?v10 ?v9 ?v7)
:precondition (and (pred_1 ?v12) (pred_1 ?v10) (pred_10 ?v9) (pred_12 ?v7)
          (pred_3 ?v12 ?v10) (pred_4 ?v9 ?v7)
                   (pred_7 ?v10 ?v7) (pred_9 ?v12) 
                   (pred_2 ?v10) (pred_8 ?v9))
:effect (and  (pred_6 ?v10) (not (pred_2 ?v10))))


(:action op_3
:parameters (?v12 ?v4)
:precondition (and (pred_1 ?v12) (pred_1 ?v4)
               (pred_9 ?v12) (pred_3 ?v12 ?v4) (pred_6 ?v4))
:effect (and (pred_9 ?v4) (not (pred_9 ?v12))))

(:action op_4
:parameters (?v12 ?v9)
:precondition (and (pred_1 ?v12) (pred_10 ?v9) 
                  (pred_9 ?v12) (pred_11 ?v9 ?v12) (pred_5 ))
:effect (and (pred_8 ?v9)
   (not (pred_11 ?v9 ?v12)) (not (pred_5 ))))


(:action op_2
:parameters (?v12 ?v13 ?v11)
:precondition (and (pred_1 ?v12) (pred_10 ?v13) (pred_10 ?v11)
                  (pred_9 ?v12) (pred_8 ?v11) (pred_11 ?v13 ?v12))
:effect (and (pred_8 ?v13) (pred_11 ?v11 ?v12)
        (not (pred_8 ?v11)) (not (pred_11 ?v13 ?v12))))

(:action op_5
:parameters (?v12 ?v9)
:precondition (and (pred_1 ?v12) (pred_10 ?v9) 
                  (pred_9 ?v12) (pred_8 ?v9))
:effect (and (pred_5 ) (pred_11 ?v9 ?v12) (not (pred_8 ?v9)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_09 obj_07 obj_25 obj_19 obj_32 obj_15 obj_20 obj_17 obj_13 obj_02 obj_31 obj_27 obj_29 obj_23 obj_21 obj_08 obj_16 obj_06 obj_12 obj_04 obj_11 obj_14 obj_03 obj_22 obj_01
    obj_30 obj_26 obj_10
    obj_05 obj_28 obj_18 obj_24
    )

    (:init
       (pred_5)

       (pred_1 obj_09)
       (pred_1 obj_07)
       (pred_1 obj_25)
       (pred_1 obj_19)
       (pred_1 obj_32)
       (pred_1 obj_15)
       (pred_1 obj_20)
       (pred_1 obj_17)
       (pred_1 obj_13)
       (pred_1 obj_02)
       (pred_1 obj_31)
       (pred_1 obj_27)
       (pred_1 obj_29)
       (pred_1 obj_23)
       (pred_1 obj_21)
       (pred_1 obj_08)
       (pred_1 obj_16)
       (pred_1 obj_06)
       (pred_1 obj_12)
       (pred_1 obj_04)
       (pred_1 obj_11)
       (pred_1 obj_14)
       (pred_1 obj_03)
       (pred_1 obj_22)
       (pred_1 obj_01)
       (pred_12 obj_30)
       (pred_12 obj_26)
       (pred_12 obj_10)
       (pred_10 obj_05)
       (pred_10 obj_28)
       (pred_10 obj_18)
       (pred_10 obj_24)

       (pred_3 obj_09 obj_15)
       (pred_3 obj_09 obj_07)
       (pred_3 obj_07 obj_20)
       (pred_3 obj_07 obj_25)
       (pred_3 obj_07 obj_09)
       (pred_3 obj_25 obj_17)
       (pred_3 obj_25 obj_19)
       (pred_3 obj_25 obj_07)
       (pred_3 obj_19 obj_13)
       (pred_3 obj_19 obj_32)
       (pred_3 obj_19 obj_25)
       (pred_3 obj_32 obj_02)
       (pred_3 obj_32 obj_19)
       (pred_3 obj_15 obj_31)
       (pred_3 obj_15 obj_20)
       (pred_3 obj_15 obj_09)
       (pred_3 obj_20 obj_27)
       (pred_3 obj_20 obj_17)
       (pred_3 obj_20 obj_07)
       (pred_3 obj_20 obj_15)
       (pred_3 obj_17 obj_29)
       (pred_3 obj_17 obj_13)
       (pred_3 obj_17 obj_25)
       (pred_3 obj_17 obj_20)
       (pred_3 obj_13 obj_23)
       (pred_3 obj_13 obj_02)
       (pred_3 obj_13 obj_19)
       (pred_3 obj_13 obj_17)
       (pred_3 obj_02 obj_21)
       (pred_3 obj_02 obj_32)
       (pred_3 obj_02 obj_13)
       (pred_3 obj_31 obj_08)
       (pred_3 obj_31 obj_27)
       (pred_3 obj_31 obj_15)
       (pred_3 obj_27 obj_16)
       (pred_3 obj_27 obj_29)
       (pred_3 obj_27 obj_20)
       (pred_3 obj_27 obj_31)
       (pred_3 obj_29 obj_06)
       (pred_3 obj_29 obj_23)
       (pred_3 obj_29 obj_17)
       (pred_3 obj_29 obj_27)
       (pred_3 obj_23 obj_12)
       (pred_3 obj_23 obj_21)
       (pred_3 obj_23 obj_13)
       (pred_3 obj_23 obj_29)
       (pred_3 obj_21 obj_04)
       (pred_3 obj_21 obj_02)
       (pred_3 obj_21 obj_23)
       (pred_3 obj_08 obj_11)
       (pred_3 obj_08 obj_16)
       (pred_3 obj_08 obj_31)
       (pred_3 obj_16 obj_14)
       (pred_3 obj_16 obj_06)
       (pred_3 obj_16 obj_27)
       (pred_3 obj_16 obj_08)
       (pred_3 obj_06 obj_03)
       (pred_3 obj_06 obj_12)
       (pred_3 obj_06 obj_29)
       (pred_3 obj_06 obj_16)
       (pred_3 obj_12 obj_22)
       (pred_3 obj_12 obj_04)
       (pred_3 obj_12 obj_23)
       (pred_3 obj_12 obj_06)
       (pred_3 obj_04 obj_01)
       (pred_3 obj_04 obj_21)
       (pred_3 obj_04 obj_12)
       (pred_3 obj_11 obj_14)
       (pred_3 obj_11 obj_08)
       (pred_3 obj_14 obj_03)
       (pred_3 obj_14 obj_16)
       (pred_3 obj_14 obj_11)
       (pred_3 obj_03 obj_22)
       (pred_3 obj_03 obj_06)
       (pred_3 obj_03 obj_14)
       (pred_3 obj_22 obj_01)
       (pred_3 obj_22 obj_12)
       (pred_3 obj_22 obj_03)
       (pred_3 obj_01 obj_04)
       (pred_3 obj_01 obj_22)
       (pred_2 obj_12)
       (pred_2 obj_11)
       (pred_2 obj_09)
       (pred_2 obj_08)
       (pred_7  obj_12 obj_30)
       (pred_7  obj_11 obj_26)
       (pred_7  obj_09 obj_10)
       (pred_7  obj_08 obj_26)
       (pred_6 obj_07)
       (pred_6 obj_25)
       (pred_6 obj_19)
       (pred_6 obj_32)
       (pred_6 obj_15)
       (pred_6 obj_20)
       (pred_6 obj_17)
       (pred_6 obj_13)
       (pred_6 obj_02)
       (pred_6 obj_31)
       (pred_6 obj_27)
       (pred_6 obj_29)
       (pred_6 obj_23)
       (pred_6 obj_21)
       (pred_6 obj_16)
       (pred_6 obj_06)
       (pred_6 obj_04)
       (pred_6 obj_14)
       (pred_6 obj_03)
       (pred_6 obj_22)
       (pred_6 obj_01)

       (pred_4  obj_05 obj_30)
       (pred_4  obj_28 obj_26)
       (pred_4  obj_18 obj_10)
       (pred_4  obj_24 obj_10)
       (pred_11 obj_05 obj_04)
       (pred_11 obj_28 obj_02)
       (pred_11 obj_18 obj_15)
       (pred_11 obj_24 obj_16)
       (pred_9 obj_19)
    )

    (:goal (and
       (pred_11 obj_05 obj_12)
    ))
(:constraints
  (always (not (pred_9 obj_23)))
)
)

; plan
1. (op_3 obj_19 obj_13)
   deleted: (pred_9 obj_19)
   added: (pred_9 obj_13)
   goals met: 0 of 1
2. (op_3 obj_13 obj_02)
   deleted: (pred_9 obj_13)
   added: (pred_9 obj_02)
   goals met: 0 of 1
3. (op_3 obj_02 obj_21)
   deleted: (pred_9 obj_02)
   added: (pred_9 obj_21)
   goals met: 0 of 1
4. (op_3 obj_21 obj_04)
   deleted: (pred_9 obj_21)
   added: (pred_9 obj_04)
   goals met: 0 of 1
5. (op_4 obj_04 obj_05)
   deleted: (pred_11 obj_05 obj_04) (pred_5)
   added: (pred_8 obj_05)
   goals met: 0 of 1
6. (op_1 obj_04 obj_12 obj_05 obj_30)
   deleted: (pred_2 obj_12)
   added: (pred_6 obj_12)
   goals met: 0 of 1
7. (op_3 obj_04 obj_12)
   deleted: (pred_9 obj_04)
   added: (pred_9 obj_12)
   goals met: 0 of 1
8. (op_5 obj_12 obj_05)
   deleted: (pred_8 obj_05)
   added: (pred_5) (pred_11 obj_05 obj_12)
   goals met: 1 of 1
